### 1.Retrieve the top 10 customers who spent the most money at the store.

- ##### Hint: You will need to join the `customers` and `invoices` tables and use an aggregate function to calculate the total amount spent by each customer.

### Expected Output

| CustomerName        | TotalSpent|
|---------------------|-----------|
| Helena Holý         | 49.62     |
| Richard Cunningham  | 47.62     |
| Luis Rojas          | 46.62     |
| François Tremblay   | 45.62     |
| Edward Francis      | 42.62     |
| Jack Smith          | 42.62     |
| Michelle Brooks     | 39.62     |
| Tim Goyer           | 39.62     |
| Robert Brown        | 39.62     |
| Jennifer Peterson   | 38.62     |

In [1]:
%run setup_notebook.ipynb

In [2]:
%%sql 

DESCRIBE customers

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
13 rows affected.

[('CustomerId', b'int', 'NO', 'PRI', None, ''),
 ('FirstName', b'text', 'YES', '', None, ''),
 ('LastName', b'text', 'YES', '', None, ''),
 ('Company', b'text', 'YES', '', None, ''),
 ('Address', b'text', 'YES', '', None, ''),
 ('City', b'text', 'YES', '', None, ''),
 ('State', b'text', 'YES', '', None, ''),
 ('Country', b'text', 'YES', '', None, ''),
 ('PostalCode', b'text', 'YES', '', None, ''),
 ('Phone', b'text', 'YES', '', None, ''),
 ('Fax', b'text', 'YES', '', None, ''),
 ('Email', b'text', 'YES', '', None, ''),
 ('SupportRepId', b'int', 'YES', 'MUL', None, '')]

In [3]:
%%sql

DESCRIBE invoices

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
9 rows affected.

[('InvoiceId', b'int', 'NO', 'PRI', None, ''),
 ('CustomerId', b'int', 'YES', 'MUL', None, ''),
 ('InvoiceDate', b'text', 'YES', '', None, ''),
 ('BillingAddress', b'text', 'YES', '', None, ''),
 ('BillingCity', b'text', 'YES', '', None, ''),
 ('BillingState', b'text', 'YES', '', None, ''),
 ('BillingCountry', b'text', 'YES', '', None, ''),
 ('BillingPostalCode', b'text', 'YES', '', None, ''),
 ('Total', b'double', 'YES', '', None, '')]

In [4]:
%%sql 

SELECT CONCAT(FirstName,' ', LastName) as CustomerName
FROM customers LIMIT 5

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
5 rows affected.

[('Luís Gonçalves',),
 ('Leonie Köhler',),
 ('François Tremblay',),
 ('Bjørn Hansen',),
 ('František Wichterlová',)]

In [5]:
%%sql

SELECT * FROM invoices LIMIT 3;

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
3 rows affected.

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94)]

In [6]:
%%sql 

SELECT SUM(Total) AS TotalSpent
FROM invoices
GROUP BY CustomerId
LIMIT 3

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
3 rows affected.

[(39.62,), (37.620000000000005,), (39.62,)]

In [7]:
%%sql 

SELECT CONCAT(c.FirstName, ' ', c.LastName) AS CustomerName, 
        ROUND(SUM(i.Total), 2) AS TotalSpent
From customers c
JOIN invoices i
ON c.CustomerId = i.CustomerId
GROUP BY i.CustomerId
ORDER BY TotalSpent DESC
LIMIT 10

 * mysql+mysqlconnector://root:***@localhost/sqlite_MediaStore
10 rows affected.

[('Helena Holý', 49.62),
 ('Richard Cunningham', 47.62),
 ('Luis Rojas', 46.62),
 ("Hugh O'Reilly", 45.62),
 ('Ladislav Kovács', 45.62),
 ('Frank Ralston', 43.62),
 ('Fynn Zimmermann', 43.62),
 ('Julia Barnett', 43.62),
 ('Astrid Gruber', 42.62),
 ('Victor Stevens', 42.62)]